app/views/trips/show.html.erb

SELECT "venues".* FROM "venues" INNER JOIN "venue_trip_links" ON "venues"."id" = "venue_trip_links"."venue_id" WHERE "venue_trip_links"."trip_id" = ?  [["trip_id", 15]]
---

        <% @trip.venues.each do |venue| %>