app/views/users/show.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 10]]
---
        <div class="triplist"><a class='myTripsHead'>My Trips</a>
          <% @user.trips.each do |trip| %>