app/controllers/trips_controller.rb

INSERT INTO "trips" ("title", "user_id", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "venues" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Flock & Fowl"], ["address", "380 W Sahara Ave\r\nThe Strip\r\nLas Vegas, NV 89102"], ["created_at", 2016-11-29 02:57:34 UTC], ["updated_at", 2016-11-29 02:57:34 UTC]]
---
  def create
    @trip = current_user.trips.new(trip_params)
    @trip.venues = @trip.venues.select do |venue|
      venue.enable == "1"
    end

    respond_to do |format|
      if @trip.save

UPDATE "trips" SET "title" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["title", "bruh"], ["updated_at", 2016-11-30 00:20:56 UTC], ["id", 16]]
---
  def update
    respond_to do |format|
      if @trip.update(trip_params)

DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 8]]
---
  def destroy
    @trip.destroy

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def set_trip
      @trip = Trip.find(params[:id])