app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", "IMG_2837.jpg"], ["avatar_file_size", 75198], ["avatar_updated_at", 2016-12-01 19:57:48 UTC], ["updated_at", 2016-12-01 19:57:49 UTC], ["id", 10]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)