app/controllers/venues_controller.rb

  def index
    @venues = Venue.all
---
SELECT "venues".* FROM "venues"

    def set_venue
      @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]